Update milestone 2 documentation
